In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

df = pd.DataFrame({
            'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
            'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
            'C' : np.random.randn(8),
            'D' : np.random.randn(8)
        })
    
print df

     A      B         C         D
0  foo    one  1.510303  1.632081
1  bar    one -0.375605  0.493706
2  foo    two -1.927578 -0.684181
3  bar  three  0.065546  0.032050
4  foo    two -0.519334  0.006162
5  bar    two  1.317536  2.488418
6  foo    one  0.894806  0.549604
7  foo  three  0.452726  1.007726

In [3]:
# sum
df.groupby('A').sum()

            C         D
A
bar  1.007476  3.014174
foo  0.410922  2.511391

In [4]:
# sum
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -0.375605  0.493706
    three  0.065546  0.032050
    two    1.317536  2.488418
foo one    2.405108  2.181685
    three  0.452726  1.007726
    two   -2.446912 -0.678019

In [9]:
# size
df.groupby('A').size()

A
bar    3
foo    5
dtype: int64

In [12]:
# count
df.groupby('B').count()

       A  C  D
B
one    3  3  3
three  2  2  2
two    3  3  3